app/views/task_details/index.html.erb

  <tbody>
    <% @task.task_details.each do |task_detail| %>
---
SELECT "task_details".* FROM "task_details" WHERE "task_details"."task_id" = ?  [["task_id", 7]]