app/controllers/tasks_controller.rb

  def create
    @task = current_user.tasks.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("description", "created_at", "updated_at", "due_date", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "task 1"], ["created_at", "2018-08-24 19:15:03.120527"], ["updated_at", "2018-08-24 19:15:03.120527"], ["due_date", "2019-01-01"], ["user_id", 2]]

  def update
    completed = @task.completed
    @task.update(task_params)
---
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2018-08-19 19:24:28.133089"], ["id", 8]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]