app/controllers/task_details_controller.rb

INSERT INTO "task_details" ("description", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "GOTTA DO THIS"], ["task_id", 7], ["created_at", "2018-08-16 17:12:38.613194"], ["updated_at", "2018-08-16 17:12:38.613194"]]
---
  def create
    @task_detail = @task.task_details.new(task_detail_params)
    if @task_detail.save

UPDATE "task_details" SET "completed" = ?, "updated_at" = ? WHERE "task_details"."id" = ?  [["completed", 1], ["updated_at", "2018-08-16 17:50:01.292338"], ["id", 1]]
---
  def update
    @task_detail.update(task_detail_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_task
    @task = current_user.tasks.find(params[:task_id])

SELECT  "task_details".* FROM "task_details" WHERE "task_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_task_detail
    @task_detail = TaskDetail.find(params[:id])